# DomainType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalSegment..::..DomainType Property
MEPAnalyticalSegment Class See Also
---
The connector domain type of this segment.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ConnectorDomainType DomainType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DomainType As ConnectorDomainType
	Get
```

Visual C++
---
```text
public:
property ConnectorDomainType DomainType {
	ConnectorDomainType get ();
}
```

# See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace